_site/org/org/2016-4-20-图像特征点.org
#+BEGIN_HTML
---
layout: post
title: 图像特征点
excerpt: 主要是总结一下与图像特征点有关的知识点
---
#+END_HTML
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
很多计算机视觉中的应用要用到局部特征点的匹配。局部特征不同于全局描述，它是对于某一点附近的patch的一种描述，我们希望这个生成的描述子具有旋转、尺度、光照和放射等条件下依然不变，这样就可以在两幅图中进行匹配。一般这个过程分为两步，首先是特征点检测(Keypoint detector)，然后是生成特征描述子。

* 特征点提取
我们需要找到图片中“突出”的点，比如Harris角点，或者DoG极值检测，还有FAST检测，为了实现尺度不变，需要在多尺度下进行检测。
* 描述子生成
得到特征点后，如何利用此点周围的分布来生成一个稳定的描述向量，具体方法有SIFT、SURF、BRIFE、BRISK、FREAK等，可以根据具体应用环境来进行选取。
* 描述子匹配
这是一个比较耗时的过程，BRIFE使用Hamming距离可以非常快。
